tap "d12frosted/emacs-plus"
tap "ethereum/ethereum"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/x11"
tap "paritytech/paritytech"
tap "thoughtbot/formulae"
brew "amazon-ecs-cli"
brew "autoconf"
brew "automake"
brew "aws-elasticbeanstalk"
brew "bat"
brew "blueutil"
brew "coreutils"
brew "ctags"
brew "docker", link: false
brew "libyaml"
brew "docker-compose", link: false
brew "docker-machine-driver-xhyve"
brew "elixir"
brew "elm"
brew "exa"
brew "exercism"
brew "gmp"
brew "gcc"
brew "fzf"
brew "gdbm"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "libksba"
brew "grip"
brew "heroku"
brew "hugo"
brew "libtool"
brew "xz"
brew "imagemagick@6", args: ["with-fftw", "with-fontconfig", "with-hdri", "with-librsvg", "with-little-cms", "with-openexr", "with-perl"]
brew "irssi"
brew "ispell"
brew "jrnl"
brew "leiningen"
brew "luajit"
brew "readline"
brew "mitmproxy"
brew "mongodb"
brew "mysql"
brew "neovim"
brew "nmap"
brew "opam"
brew "postgresql", restart_service: true
brew "sqlite"
brew "python"
brew "ripgrep"
brew "shellcheck"
brew "stow"
brew "swi-prolog"
brew "terraform"
brew "tmux"
brew "tokei"
brew "vim"
brew "watchman"
brew "wireguard-tools"
brew "wrk"
brew "xhyve"
brew "yarn"
brew "youtube-dl"
brew "d12frosted/emacs-plus/emacs-plus@25", args: ["HEAD", "with-dbus", "with-mailutils"]
brew "ethereum/ethereum/ethereum"
brew "paritytech/paritytech/parity"
cask "alacritty"
cask "keepassxc"
cask "supercollider"
