## Tap open the Brew
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

## GNU Tools
brew "gawk"
brew "grep"
brew "make"
brew "makefile2graph"
brew "stow"
brew "gcc"
brew "gsed"
brew "gnupg"
brew "gpgme"
brew "gnuplot"
brew "libgccjit"
brew "coreutils"
brew "findutils"
brew "moreutils"

## GNew Tools
brew "ripgrep"
brew "ripgrep-all"
brew "fd"
brew "bat"
brew "exa"

## Git Updates
brew "git"
brew "git-delta"
brew "git-lfs"

## Encryption
tap "filippo.io/age", "https://filippo.io/age"
brew "age"
brew "mkcert"
brew "oath-toolkit"

## Update Shell
brew "zsh"

## Terminal Niceties
cask "alacritty"
cask "iterm2"
brew "tmux"
tap "koekeishiya/formulae"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "fzf"
brew "broot"
brew "starship"
brew "pngpaste"

## Project Configuration
brew "asdf"
brew "editorconfig"
brew "direnv"
brew "entr"

## Data Munging
brew "jq"
brew "xsv"
brew "hexyl"
brew "difftastic"
brew "pandoc"
brew "p7zip"

## API Tools
brew "protobuf"
brew "openapi-generator"

## Linting and Formating
brew "markdownlint-cli"
brew "clang-format"
brew "shellcheck"
brew "shfmt"

## Database
brew "sqlite"

## Performance
brew "htop"
brew "netperf"
tap "muesli/tap"
brew "muesli/tap/duf"
cask "stats"

## Networking
brew "wget"
brew "curl"
brew "nmap"
brew "telnet"
brew "libssh"
cask "charles"
cask "wireshark"

# Virtualization
tap "jesseduffield/lazydocker"
brew "lazydocker"
brew "libvterm"
brew "qemu" # nw

## Syncing
brew "rclone" # nw
cask "nextcloud"

## Documentaion
cask "dash"
brew "dashing"
brew "tldr"

## Writing
brew "enchant"
brew "wordnet" #nw
brew "poppler" # nw
brew "texlab" # nw

# Graphics
brew "graphviz"
brew "imagemagick"

## GitHub
brew "gh"
brew "grip"

## Code Editors
tap "d12frosted/emacs-plus"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-imagemagick", "with-native-comp", "with-no-frame-refocus", "with-no-titlebar", "with-xwidgets"]
cask "visual-studio-code"

# Learning
brew "exercism"

## Website
brew "hugo" # nw

## App Store
brew "mas"

## Communications
cask "discord" # nw
cask "slack"

## Productivity
cask "alfred"
cask "bartender"
mas "Amphetamine", id: 937984704
mas "Be Focused Pro", id: 961632517
cask "focus"
cask "todoist"
cask "fantastical"
cask "finicky"

## Font
cask "font-iosevka"

## Security
cask "oversight"
mas "Shush", id: 496437906

## Music
cask "spotify"
