tap "bufbuild/buf"
tap "d12frosted/emacs-plus"
tap "filippo.io/age", "https://filippo.io/age"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "koekeishiya/formulae"
tap "mapbox/cli"
tap "muesli/tap"
tap "railwaycat/emacsmacport"
tap "schniz/tap"
tap "sqitchers/sqitch"
tap "stripe/stripe-cli"
tap "tilt-dev/tap"
brew "age"
brew "automake"
brew "coreutils"
brew "unixodbc"
brew "asdf"
brew "aspell"
brew "sqlite"
brew "awscli"
brew "bat"
brew "broot"
brew "clang-format"
brew "cmake"
brew "ctags"
brew "curl"
brew "dashing"
brew "dbus"
brew "difftastic"
brew "direnv"
brew "editorconfig"
brew "enchant"
brew "entr"
brew "exa"
brew "exercism"
brew "fd"
brew "gobject-introspection"
brew "harfbuzz"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gcc"
brew "geos"
brew "librttopo"
brew "libspatialite"
brew "gdal"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "gpgme"
brew "nghttp2"
brew "gnuplot"
brew "golangci-lint"
brew "graphviz"
brew "grep"
brew "grip"
brew "h3"
brew "helm"
brew "hexyl"
brew "htop"
brew "hugo"
brew "hunspell"
brew "imagemagick"
brew "ispell"
brew "jq"
brew "k3d"
brew "kind"
brew "languagetool"
brew "lazydocker"
brew "libgccjit"
brew "libgr"
brew "libssh"
brew "libvterm"
brew "libxmlsec1"
brew "lynis"
brew "mailutils"
brew "make"
brew "makefile2graph"
brew "markdownlint-cli"
brew "mas"
brew "mkcert"
brew "moreutils"
brew "protobuf"
brew "mosh"
brew "mu"
brew "mysql-client"
brew "n"
brew "netperf"
brew "nmap"
brew "oath-toolkit"
brew "openapi-generator"
brew "p7zip"
brew "pandoc"
brew "pgcli"
brew "pgloader"
brew "pinentry-mac"
brew "plantuml"
brew "pngpaste"
brew "poppler"
brew "pre-commit"
brew "pulumi"
brew "qemu"
brew "rclone"
brew "ripgrep"
brew "ripgrep-all"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stow"
brew "subversion"
brew "telnet"
brew "tesseract-lang"
brew "texlab"
brew "tippecanoe"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "vim"
brew "wget"
brew "wordnet"
brew "wxwidgets"
brew "xsv"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-imagemagick", "with-native-comp", "with-no-frame-refocus", "with-no-titlebar", "with-xwidgets"]
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mapbox/cli/mapbox"
brew "muesli/tap/duf"
brew "stripe/stripe-cli/stripe"
brew "tilt-dev/tap/ctlptl"
brew "tilt-dev/tap/tilt"
cask "adoptopenjdk"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "bartender"
cask "charles"
cask "dash"
cask "discord"
cask "docker"
cask "fantastical"
cask "finicky"
cask "firefox"
cask "focus"
cask "font-iosevka"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "mactex"
cask "mysql-shell"
cask "nextcloud"
cask "obsidian"
cask "oversight"
cask "postman"
cask "slack"
cask "spotify"
cask "stats"
cask "temurin"
cask "tla-plus-toolbox"
cask "todoist"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Be Focused Pro", id: 961632517
mas "Gifox", id: 1461845568
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Shush", id: 496437906
