tap "d12frosted/emacs-plus"
tap "filippo.io/age", "https://filippo.io/age"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "muesli/tap"
tap "railwaycat/emacsmacport"
tap "schniz/tap"
tap "sqitchers/sqitch"
# Simple, modern, secure file encryption
brew "age"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Spell checker with better logic than ispell
brew "aspell"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Message bus system, providing inter-application communication
brew "dbus", restart_service: true
# Load/unload environment variables based on $PWD
brew "direnv"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Run arbitrary commands when files change
brew "entr"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Command-driven, interactive function plotting
brew "gnuplot"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GitHub Markdown previewer
brew "grip"
# Improved top (interactive process viewer)
brew "htop"
# Spell checker and morphological analyzer
brew "hunspell"
# International Ispell
brew "ispell"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Style and grammar checker
brew "languagetool"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# XML security library
brew "libxmlsec1"
# Security and system auditing tool to harden systems
brew "lynis"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Tool for searching e-mail messages stored in the maildir-format
brew "mu"
# Benchmarks performance of many different types of networking
brew "netperf"
# Port scanning utility for large networks
brew "nmap"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Paste PNG into files
brew "pngpaste"
# Emulator for x86 and PowerPC
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Lexical database for the English language
brew "wordnet"
# Fast CSV toolkit written in Rust
brew "xsv"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@27", args: ["with-dbus", "with-mailutils", "with-no-frame-refocus", "with-no-titlebar", "with-xwidgets"]
# Disk Usage/Free Utility
brew "muesli/tap/duf"
brew "sqitchers/sqitch/sqitch", args: ["with-postgres-support", "with-sqlite-support"]
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Menu bar icon organizer
cask "bartender"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Calendar software
cask "fantastical"
# Utility for customizing which browser to start
cask "finicky"
# Web browser
cask "firefox"
cask "focus"
# Monospaced typeface designed for programming in Julia
cask "font-juliamono"
cask "font-source-code-pro"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Monitors computer mic and webcam
cask "oversight"
# Collaboration platform for API development
cask "postman"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# IDE for TLA+
cask "tla-plus-toolbox"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organize, cite, and share research sources
cask "zotero"
mas "Amphetamine", id: 937984704
mas "Be Focused Pro", id: 961632517
mas "Gifox", id: 1461845568
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Shush", id: 496437906
