tap "cjbassi/gotop"
tap "d12frosted/emacs-plus"
tap "filippo.io/age", "https://filippo.io/age"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "muesli/tap"
tap "railwaycat/emacsmacport"
tap "schniz/tap"
tap "sqitchers/sqitch"
# Simple, modern, secure file encryption
brew "age"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Library for command-line editing
brew "readline"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Spell checker with better logic than ispell
brew "aspell"
# General-purpose data compression with high compression ratio
brew "xz"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Message bus system, providing inter-application communication
brew "dbus", restart_service: true
# Load/unload environment variables based on $PWD
brew "direnv"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Run arbitrary commands when files change
brew "entr"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# Network authentication protocol
brew "krb5"
# GNOME XML library
brew "libxml2"
# Postgres C API library
brew "libpq"
# Libraries for security-enabled client and server applications
brew "nss"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Command-driven, interactive function plotting
brew "gnuplot"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GitHub Markdown previewer
brew "grip"
# Make JSON greppable
brew "gron"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Spell checker and morphological analyzer
brew "hunspell"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# International Ispell
brew "ispell"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Style and grammar checker
brew "languagetool"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# XML security library
brew "libxmlsec1"
# Security and system auditing tool to harden systems
brew "lynis"
# Swiss Army knife of email handling
brew "mailutils"
# Utility for directing compilation
brew "make"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# C++ search engine library
brew "xapian"
# Tool for searching e-mail messages stored in the maildir-format
brew "mu"
# Benchmarks performance of many different types of networking
brew "netperf"
# Port scanning utility for large networks
brew "nmap"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Paste PNG into files
brew "pngpaste"
# Object-relational database system
brew "postgresql", restart_service: true
# Cloud native development platform
brew "pulumi"
# Emulator for x86 and PowerPC
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Official documentation format of the GNU project
brew "texinfo"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Lexical database for the English language
brew "wordnet"
# Fast CSV toolkit written in Rust
brew "xsv"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# A terminal based graphical activity monitor inspired by gtop and vtop
brew "cjbassi/gotop/gotop"
# Disk Usage/Free Utility
brew "muesli/tap/duf"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-dbus", "with-glib", "with-imagemagick", "with-no-title-bars", "with-rsvg", "with-starter"]
brew "sqitchers/sqitch/sqitch", args: ["with-postgres-support", "with-sqlite-support"]
cask "adoptopenjdk"
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"
# GPU-accelerated terminal emulator
cask "alacritty"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Reverse engineering platform powered by radare2
cask "cutter"
# Utility for customizing which browser to start
cask "finicky"
# Monospaced typeface designed for programming in Julia
cask "font-juliamono"
cask "font-source-code-pro"
cask "graphql-playground"
cask "java"
cask "pgadmin4"
# Tool to create native applications from command-line scripts
cask "platypus"
# Geographic Information System
cask "qgis"
# System monitor for the menu bar
cask "stats"
# IDE for TLA+
cask "tla-plus-toolbox"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark"
