tap "caskroom/cask"
tap "caskroom/fonts"
tap "ethereum/ethereum"
tap "homebrew/bundle"
tap "homebrew/core"
tap "paritytech/paritytech"
tap "thoughtbot/formulae"
brew "autoconf"
brew "automake"
brew "aws-elasticbeanstalk"
brew "ocaml"
brew "coreutils"
brew "ctags"
brew "git"
brew "docker"
brew "libyaml"
brew "docker-compose"
brew "docker-machine-driver-xhyve"
brew "elixir"
brew "elm"
brew "emacs"
brew "exercism"
brew "fzf"
brew "gmp"
brew "gcc"
brew "gdbm"
brew "readline"
brew "python"
brew "git-lfs"
brew "libksba"
brew "go"
brew "grip"
brew "heroku"
brew "hugo"
brew "libtool"
brew "irssi"
brew "mongodb"
brew "neovim"
brew "opam"
brew "postgresql"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "vim"
brew "watchman"
brew "wrk"
brew "xhyve"
brew "yarn"
brew "youtube-dl"
brew "ethereum/ethereum/ethereum"
brew "paritytech/paritytech/parity"
